Revit 2027 API
InitialColor.TemperatureValue Property
 The light color temperature value in Kelvins.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TemperatureValue { get; }
Public ReadOnly Property TemperatureValue As Double
	Get
public:
property double TemperatureValue {
	double get ();
}
member TemperatureValue : float with get
Property Value
Double
See Also
Reference
InitialColor Class
Autodesk.Revit.DB.Lighting Namespace